In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={
    "name":['santosh','keshav','nabin','susil'],
    "marks":[95,98,99,90],
    "city":["pokhara",syangja","bajhang","chitwan"]
    
}

In [4]:
df=pd.DataFrame(dict1)

In [7]:
df

      name  marks     city
0  santosh     95  pokhara
1   keshav     98  syangja
2    nabin     99  bajhang
3    susil     90  chitwan

In [8]:
df.to_csv("Friends_info.csv")   #csv mah convert gareko

In [9]:
df.head(2)  #first ko 2 ota rows dekhuxa

      name  marks     city
0  santosh     95  pokhara
1   keshav     98  syangja

In [10]:
df.tail(2)  #last ko 2 ota rows dekhuxa

    name  marks     city
2  nabin     99  bajhang
3  susil     90  chitwan

In [11]:
df.describe()  #stastical analysis garxa

           marks
count   4.000000
mean   95.500000
std     4.041452
min    90.000000
25%    93.750000
50%    96.500000
75%    98.250000
max    99.000000